{
  "intro": "Hello! My name is Maxwell, and I am a software engineer. I currently work as the Senior Curriculum Manager of Software Engineering at Flatiron School. I design and create coursework for students online and on campuses across the United States.",
  "experience": [
    {
      "title": "Senior Curriculum Manager",
      "dates": ["01/2021", "Present"],
      "companies": [
        {"title": "Flatiron School", "url": "https://flatironschool.com/"}
      ],
      "responsibilities": []
    },
    {
      "title": "Software Engineer",
      "dates": ["05/2020", "01/2021"],
      "companies": [
        {"title": "Flatiron School", "url": "https://flatironschool.com/"}
      ],
      "responsibilities": []
    },
    {
      "title": "Senior Curriculum Designer",
      "dates": ["04/2019", "05/2020"],
      "companies": [
        {"title": "Flatiron School", "url": "https://flatironschool.com/"}, 
        {"title": "WeWork", "url": "https://www.wework.com/"}
      ],
      "responsibilities": [
        "Led team projects to update and redesign course materials on both Ruby and React, deployed to hundreds of students",
        "Performed maintenance operations on one of GitHub’s largest organizations",
        "Brought an existing 1500+ GitHub issue count to 0",
        "Improved existing repository linter for maintaining standards across over 1000 repositories",
        "Implemented operating procedures for rolling out Curriculum content"
      ]
    },
    {
      "title": "Senior Curriculum Writer",
      "dates": ["07/2018", "04/2019"],
      "companies": [
        {"title": "Flatiron School", "url": "https://flatironschool.com/"}, 
        {"title": "WeWork", "url": "https://www.wework.com/"}
      ],
      "responsibilities": [
        "Built Ruby gems to assist in GitHub repository creation and management, improving the consistency and efficiency of repository creation by the Curriculum team",
        "Created, maintained and updated test driven student materials using RSpec for Ruby and Mocha/Chai for JS testing",
        "Managed internal feedback, priority issue tracking and communication with stakeholders through JIRA"
      ]
    },
    {
      "title": "Curriculum Writer",
      "dates": ["03/2018","07/2018"],
      "companies": [
        {"title": "Flatiron School", "url": "https://flatironschool.com/"}, 
        {"title": "WeWork", "url": "https://www.wework.com/"}
      ],
      "responsibilities": [
        "Maintained Curriculum through GitHub repositories, resolving critical issues",
        "Created student lessons and assessments for Ruby, Rails, JavaScript and React",
        "Redesigned materials and approach for teaching React/Redux"
      ]
    },
    {
      "title": "Junior Instructor",
      "dates": ["08/2017", "03/2018"],
      "companies": [
        {"title": "Flatiron School", "url": "https://flatironschool.com/"}, 
        {"title": "WeWork", "url": "https://www.wework.com/"}
      ],
      "responsibilities": [
        "Taught students in all areas of coursework, including Ruby, Rails, JavaScript, React and Redux",
        "Conducted technical lectures, reviews and community projects",
        "Provided feedback on code and tutoring for students"
      ]
    },
    {
      "title": "Associate Coordindator",
      "dates": ["09/2015","01/2017"],
      "companies": [
        {"title": "Whole Foods", "url": "https://wholefoods.com/"}
      ],
      "responsibilities": [
        "Directly oversaw CS team operations in thirteen stores, conducted audits, as well as, leadership training and reviews",
        "Responsible for cash office operations in thirty-five stores, maintaining standards and introducing operational efficiencies",
        "Conducted regular meetings of 40-80 leaders, hosted conference calls, leadership interviews, and general support as needed",
        "Maintained and advanced the overall Customer Service program for the region (New York, New Jersey, Connecticut)"
      ]
    },
    {
      "title": "Customer Service Team Leader",
      "dates": ["07/2014","09/2015"],
      "companies": [
        {"title": "Whole Foods", "url": "https://wholefoods.com/"}
      ],
      "responsibilities": [
        "Led a team of fifty-five Team Members, seven Supervisors and two Associate Team Leaders",
        "Responsible for all operations, including hiring, terminations, corrective conversations, reviews, interviews and daily tasks"
      ]
    }
  ]
}
